In [9]:
import pandas as pd

In [10]:
# SERIES

In [11]:
s = pd.Series([12,34,56,73,23])

In [12]:
print(s)

0    12
1    34
2    56
3    73
4    23
dtype: int64

In [13]:
s = pd.Series([12,34,56,73,23,21.22])

In [14]:
print(s)

0    12.00
1    34.00
2    56.00
3    73.00
4    23.00
5    21.22
dtype: float64

In [15]:
s.dtype

dtype('float64')

In [16]:
s.size

6

In [17]:
s[3]

73.0

In [18]:
s[3]=100

In [19]:
s

0     12.00
1     34.00
2     56.00
3    100.00
4     23.00
5     21.22
dtype: float64

In [20]:
s = pd.Series([12,34,56,73,23,21.22], index = range(100, 106))
s

100    12.00
101    34.00
102    56.00
103    73.00
104    23.00
105    21.22
dtype: float64

In [21]:
s[103]

73.0

In [22]:
# DATAFRAMES

In [23]:
roll = pd.Series([1, 2, 3, 4, 5])
name = pd.Series(['mayuri', 'shamu', 'jyoti', 'sakshi', 'swara'])
marks = pd.Series([67, 69, 71, 73, 75])

In [24]:
df = pd.DataFrame({
    'roll':roll,
    'name':name,
    'marks':marks,
})

In [25]:
df

   roll    name  marks
0     1  mayuri     67
1     2   shamu     69
2     3   jyoti     71
3     4  sakshi     73
4     5   swara     75

In [26]:
df.shape

(5, 3)

In [27]:
df.size

15

In [28]:
df.columns

Index(['roll', 'name', 'marks'], dtype='object')

In [29]:
# current working directory
import os
os.getcwd()

'C:\\Users\\admin'

In [30]:
# location:https://mitu.co.in/dataset
#download all the files starting from student
#in yout current working directory

In [34]:
df = pd.read_csv('student8.csv')

In [35]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [41]:
headers=['A','B','C','D','E']
df1=pd.read_csv('student8.csv',names=headers) 
df1

       A        B      C      D    E
0   roll     name  class  marks  age
1      1     anil     TE  56.77   22
2      2     amit     TE  59.77   21
3      3   aniket     BE  76.88   19
4      4  ajinkya     TE  69.66   20
5      5     asha     TE  63.28   20
6      6   ayesha     BE  49.55   20
7      7     amar     BE  65.34   19
8      8    amita     BE  68.33   23
9      9     amol     TE  56.75   20
10    10    anmol     BE  78.66   21

In [45]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [46]:
df.shape

(10, 5)

In [47]:
df.size

50

In [48]:
list(df.columns)

['roll', 'name', 'class', 'marks', 'age']

In [49]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [61]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,101,102,103,104,105,106,107,108,109,110
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [62]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [63]:
df.empty

False

In [64]:
df.values

array([[101, 'anil', 'TE', 56.77, 22],
       [102, 'amit', 'TE', 59.77, 21],
       [103, 'aniket', 'BE', 76.88, 19],
       [104, 'ajinkya', 'TE', 69.66, 20],
       [105, 'asha', 'TE', 63.28, 20],
       [106, 'ayesha', 'BE', 49.55, 20],
       [107, 'amar', 'BE', 65.34, 19],
       [108, 'amita', 'BE', 68.33, 23],
       [109, 'amol', 'TE', 56.75, 20],
       [110, 'anmol', 'BE', 78.66, 21]], dtype=object)

In [65]:
df

   roll     name class  marks  age
0   101     anil    TE  56.77   22
1   102     amit    TE  59.77   21
2   103   aniket    BE  76.88   19
3   104  ajinkya    TE  69.66   20
4   105     asha    TE  63.28   20
5   106   ayesha    BE  49.55   20
6   107     amar    BE  65.34   19
7   108    amita    BE  68.33   23
8   109     amol    TE  56.75   20
9   110    anmol    BE  78.66   21

In [66]:
df.head(3)

   roll    name class  marks  age
0   101    anil    TE  56.77   22
1   102    amit    TE  59.77   21
2   103  aniket    BE  76.88   19

In [67]:
df.tail(3)

   roll   name class  marks  age
7   108  amita    BE  68.33   23
8   109   amol    TE  56.75   20
9   110  anmol    BE  78.66   21

In [68]:
df.sum()

roll                                                  1055
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [69]:
df.max()

roll        110
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [70]:
df.count()

roll     10
name     10
class    10
marks    10
age      10
dtype: int64

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [72]:
df.describe()

            roll      marks        age
count   10.00000  10.000000  10.000000
mean   105.50000  64.499000  20.500000
std      3.02765   9.207179   1.269296
min    101.00000  49.550000  19.000000
25%    103.25000  57.520000  20.000000
50%    105.50000  64.310000  20.000000
75%    107.75000  69.327500  21.000000
max    110.00000  78.660000  23.000000

In [73]:
# DATA SLICING

In [74]:
df

   roll     name class  marks  age
0   101     anil    TE  56.77   22
1   102     amit    TE  59.77   21
2   103   aniket    BE  76.88   19
3   104  ajinkya    TE  69.66   20
4   105     asha    TE  63.28   20
5   106   ayesha    BE  49.55   20
6   107     amar    BE  65.34   19
7   108    amita    BE  68.33   23
8   109     amol    TE  56.75   20
9   110    anmol    BE  78.66   21

In [75]:
df.iloc[2:5,0:3]

   roll     name class
2   103   aniket    BE
3   104  ajinkya    TE
4   105     asha    TE

In [80]:
x=df.iloc[2:5,0:3]

In [81]:
x

   roll     name class
2   103   aniket    BE
3   104  ajinkya    TE
4   105     asha    TE

In [83]:
df.iloc[6:,0:5]

   roll   name class  marks  age
6   107   amar    BE  65.34   19
7   108  amita    BE  68.33   23
8   109   amol    TE  56.75   20
9   110  anmol    BE  78.66   21

In [84]:
df.iloc[5,0:3]

roll        106
name     ayesha
class        BE
Name: 5, dtype: object

In [85]:
df.iloc[3:6,1]

3    ajinkya
4       asha
5     ayesha
Name: name, dtype: object

In [86]:
df.iloc[3:6,1]

3    ajinkya
4       asha
5     ayesha
Name: name, dtype: object

In [87]:
df.iloc[:,3]

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64

In [88]:
df.iloc[[1,4,6,7],[0,2,3]]

   roll class  marks
1   102    TE  59.77
4   105    TE  63.28
6   107    BE  65.34
7   108    BE  68.33

In [89]:
df.iloc[6,1]

'amar'

In [90]:
df.iloc[6:7,1:2]

   name
6  amar

In [91]:
df.loc[: ,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [94]:
df.loc[2:5,'name']

2     aniket
3    ajinkya
4       asha
5     ayesha
Name: name, dtype: object

In [95]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [96]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [97]:
df[['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [98]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [36]:
ind = {1: 'one', 4: 'four'}
df.rename(index = ind)

      roll     name class  marks  age
0        1     anil    TE  56.77   22
one      2     amit    TE  59.77   21
2        3   aniket    BE  76.88   19
3        4  ajinkya    TE  69.66   20
four     5     asha    TE  63.28   20
5        6   ayesha    BE  49.55   20
6        7     amar    BE  65.34   19
7        8    amita    BE  68.33   23
8        9     amol    TE  56.75   20
9       10    anmol    BE  78.66   21

In [38]:
# iterate

for x in df:
    print(x)

roll
name
class
marks
age

In [40]:
for x in df:
    print(df[x])

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: roll, dtype: int64
0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object
0    TE
1    TE
2    BE
3    TE
4    TE
5    BE
6    BE
7    BE
8    TE
9    BE
Name: class, dtype: object
0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64
0    22
1    21
2    19
3    20
4    20
5    20
6    19
7    23
8    20
9    21
Name: age, dtype: int64

In [42]:
# sort the values

In [43]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [44]:
df.sort_values(by = 'class')

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [50]:
df.sort_values(by = 'class')

AttributeError: 'DataFrame' object has no attribute 'sort_'

In [51]:
df['marks'].max()

78.66

In [52]:
df['marks'].mean()

64.499

In [53]:
df['marks'].median()

64.31

In [54]:
#methods on string

In [55]:
df['name'].str.title()

0       Anil
1       Amit
2     Aniket
3    Ajinkya
4       Asha
5     Ayesha
6       Amar
7      Amita
8       Amol
9      Anmol
Name: name, dtype: object

In [56]:
df['name'].str.startswith('an')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: name, dtype: bool

In [57]:
df['name'].str.contains('n')

0     True
1    False
2     True
3     True
4    False
5    False
6    False
7    False
8    False
9     True
Name: name, dtype: bool

In [59]:
df['roll'] = df['roll'] + 100

In [60]:
df

   roll     name class  marks  age
0   101     anil    TE  56.77   22
1   102     amit    TE  59.77   21
2   103   aniket    BE  76.88   19
3   104  ajinkya    TE  69.66   20
4   105     asha    TE  63.28   20
5   106   ayesha    BE  49.55   20
6   107     amar    BE  65.34   19
7   108    amita    BE  68.33   23
8   109     amol    TE  56.75   20
9   110    anmol    BE  78.66   21

In [76]:
gender = ['m','m','m','m','f','f','m','f','m','m']

In [77]:
df['gender'] = gender

In [78]:
df

   roll     name class  marks  age gender
0   101     anil    TE  56.77   22      m
1   102     amit    TE  59.77   21      m
2   103   aniket    BE  76.88   19      m
3   104  ajinkya    TE  69.66   20      m
4   105     asha    TE  63.28   20      f
5   106   ayesha    BE  49.55   20      f
6   107     amar    BE  65.34   19      m
7   108    amita    BE  68.33   23      f
8   109     amol    TE  56.75   20      m
9   110    anmol    BE  78.66   21      m

In [92]:
df['cgpa'] = df ['marks']/10 + 0.5

In [93]:
df

   roll     name class  marks  age gender   cgpa
0   101     anil    TE  56.77   22      m  6.177
1   102     amit    TE  59.77   21      m  6.477
2   103   aniket    BE  76.88   19      m  8.188
3   104  ajinkya    TE  69.66   20      m  7.466
4   105     asha    TE  63.28   20      f  6.828
5   106   ayesha    BE  49.55   20      f  5.455
6   107     amar    BE  65.34   19      m  7.034
7   108    amita    BE  68.33   23      f  7.333
8   109     amol    TE  56.75   20      m  6.175
9   110    anmol    BE  78.66   21      m  8.366

In [99]:
df['gender'].value_counts()

gender
m    7
f    3
Name: count, dtype: int64

In [100]:
df['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [101]:
df['gender'].mode()

0    m
Name: gender, dtype: object

In [102]:
df['class'].mode()

0    BE
1    TE
Name: class, dtype: object

In [104]:
# GEOUP BY

In [105]:
df

   roll     name class  marks  age gender   cgpa
0   101     anil    TE  56.77   22      m  6.177
1   102     amit    TE  59.77   21      m  6.477
2   103   aniket    BE  76.88   19      m  8.188
3   104  ajinkya    TE  69.66   20      m  7.466
4   105     asha    TE  63.28   20      f  6.828
5   106   ayesha    BE  49.55   20      f  5.455
6   107     amar    BE  65.34   19      m  7.034
7   108    amita    BE  68.33   23      f  7.333
8   109     amol    TE  56.75   20      m  6.175
9   110    anmol    BE  78.66   21      m  8.366

In [107]:
gr = df.groupby('class')

In [108]:
gr.groups

{'BE': [2, 5, 6, 7, 9], 'TE': [0, 1, 3, 4, 8]}

In [109]:
gr.get_group('TE')

   roll     name class  marks  age gender   cgpa
0   101     anil    TE  56.77   22      m  6.177
1   102     amit    TE  59.77   21      m  6.477
3   104  ajinkya    TE  69.66   20      m  7.466
4   105     asha    TE  63.28   20      f  6.828
8   109     amol    TE  56.75   20      m  6.175

In [110]:
import numpy as np

In [111]:
gr['marks'].mean()

class
BE    67.752
TE    61.246
Name: marks, dtype: float64

In [112]:
#### concate and merge

In [113]:
df

   roll     name class  marks  age gender   cgpa
0   101     anil    TE  56.77   22      m  6.177
1   102     amit    TE  59.77   21      m  6.477
2   103   aniket    BE  76.88   19      m  8.188
3   104  ajinkya    TE  69.66   20      m  7.466
4   105     asha    TE  63.28   20      f  6.828
5   106   ayesha    BE  49.55   20      f  5.455
6   107     amar    BE  65.34   19      m  7.034
7   108    amita    BE  68.33   23      f  7.333
8   109     amol    TE  56.75   20      m  6.175
9   110    anmol    BE  78.66   21      m  8.366

In [114]:
df.drop(['gender','cgpa'], axis = 1, inplace = True)

In [116]:
df

   roll     name class  marks  age
0   101     anil    TE  56.77   22
1   102     amit    TE  59.77   21
2   103   aniket    BE  76.88   19
3   104  ajinkya    TE  69.66   20
4   105     asha    TE  63.28   20
5   106   ayesha    BE  49.55   20
6   107     amar    BE  65.34   19
7   108    amita    BE  68.33   23
8   109     amol    TE  56.75   20
9   110    anmol    BE  78.66   21

In [117]:
# create a dataframe containing roll,gender,cgpa columns
# here roll column will be same as df

In [121]:
cgpa = df['marks']/10 + 0.5

In [122]:
newdf = pd.DataFrame({
    'roll': range(101,111),
    'gender': gender,
    'cgpa': cgpa
})

In [124]:
newdf

   roll gender   cgpa
0   101      m  6.177
1   102      m  6.477
2   103      m  8.188
3   104      m  7.466
4   105      f  6.828
5   106      f  5.455
6   107      m  7.034
7   108      f  7.333
8   109      m  6.175
9   110      m  8.366

In [125]:
# MERGE

df.merge(newdf, on = 'roll')

   roll     name class  marks  age gender   cgpa
0   101     anil    TE  56.77   22      m  6.177
1   102     amit    TE  59.77   21      m  6.477
2   103   aniket    BE  76.88   19      m  8.188
3   104  ajinkya    TE  69.66   20      m  7.466
4   105     asha    TE  63.28   20      f  6.828
5   106   ayesha    BE  49.55   20      f  5.455
6   107     amar    BE  65.34   19      m  7.034
7   108    amita    BE  68.33   23      f  7.333
8   109     amol    TE  56.75   20      m  6.175
9   110    anmol    BE  78.66   21      m  8.366

In [126]:
newdf = pd.read_csv('student5.csv')
newdf

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [127]:
pd.concat([df, newdf], ignore_index = True)

    roll     name class  marks  age
0    101     anil    TE  56.77   22
1    102     amit    TE  59.77   21
2    103   aniket    BE  76.88   19
3    104  ajinkya    TE  69.66   20
4    105     asha    TE  63.28   20
5    106   ayesha    BE  49.55   20
6    107     amar    BE  65.34   19
7    108    amita    BE  68.33   23
8    109     amol    TE  56.75   20
9    110    anmol    BE  78.66   21
10     1   surbhi    TE  67.44   23
11     2    sujay    TE  74.12   22
12     3  subhash    BE  82.44   21
13     4   sachin    TE  59.33   21
14     5  shalini    TE  63.45   20

In [ ]:
# boolean filtering

In [128]:
df['marks'] > 60

0    False
1    False
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [129]:
df[df['marks'] > 60]

   roll     name class  marks  age
2   103   aniket    BE  76.88   19
3   104  ajinkya    TE  69.66   20
4   105     asha    TE  63.28   20
6   107     amar    BE  65.34   19
7   108    amita    BE  68.33   23
9   110    anmol    BE  78.66   21

In [147]:
df[(df['marks'] > 60) & (df['class'] == 'BE')]

   roll    name class  marks  age
2   103  aniket    BE  76.88   19
6   107    amar    BE  65.34   19
7   108   amita    BE  68.33   23
9   110   anmol    BE  78.66   21

In [149]:
x = df[(df['marks'] > 60) & (df['class'] == 'BE')]
x

   roll    name class  marks  age
2   103  aniket    BE  76.88   19
6   107    amar    BE  65.34   19
7   108   amita    BE  68.33   23
9   110   anmol    BE  78.66   21

In [138]:
# EXPORT THE DATASET

In [146]:
x.to_csv('output.csv', index=False)